/* <================================================================================================================> */
/* <============================================== НЕОБХОДИМЫЕ МОДУЛИ ==============================================> */
/* <================================================================================================================> */

// 1. Модуль Gulp - предоставляет функционал для работы с  Gulp
import gulp from "gulp";

// 2. Модуль GulpPug - преобразует pug-файлы в html-файлы
import GulpPug from "gulp-pug";

// 3. Пользовательский модуль Path - предоставляет информацию о путях к необходимым файлам/папкам
import { path } from "../config/path.js";

/* <================================================================================================================> */
/* <================================== РЕАЛИЗАЦИЯ ЗАДАЧИ КОПИРОВАНИЯ HTML-ФАЙЛОВ ===================================> */
/* <================================================================================================================> */

// Функция копирует html-файлы из папки с исходниками в папку с результатом:
export const copyPug = () => {
    return gulp.src(path.src.pug)           // Считываем из папки с исходниками необходимые pug-файл
        .pipe(GulpPug({pretty: true}))      // Преобразование pug-файлов в html-файлы
        .pipe(gulp.dest(path.build.html));  // Запись необходимых html-файлов в папку с результатом
};